{
  "first_name": "DAN",
  "last_name": "SULLIVAN",
  "phone_number": {
    "number": "(312) 607-3702",
    "uri": "tel://3126073702"
  },
  "email": {
    "email": "resume@a2f0.net",
    "uri": "mailto:resume@a2f0.net"
  },
  "city_state": "New York, NY",
  "url": "https://github.com/a2f0/resume",
  "internet_presences": [
    "https://a2f0.net",
    "https://tearleads.com",
    "https://devopsrockstars.com",
    "https://github.com/a2f0",
    "https://linkedin.com/in/a2f0"
  ],
  "experience": [
    {
      "company": "Tearleads",
      "title": "Product Builder",
      "date_range": "Jul 2014 - Current",
      "url": "https://tearleads.com/",
      "accomplishments": [
        "Increased developer and sysadmin productivity by creating a public application that optimizes repetitive access patterns for atomic pieces of meaningful data.",
        "Built and deployed all components from scratch including FE/BE, CI/CD, static code analysis, test coverage, IaC, containerized workflows, OAuth2 integration, and observability instrumentation."
      ],
      "location": "Chicago, USA",
      "technologies": [
        "Django",
        "Docker",
        "ECS",
        "Terraform",
        "AWS",
        "EC2",
        "PostgreSQL"
      ]
    },
    {
      "company": "DevOpsRockstars",
      "title": "Owner",
      "date_range": "May 2017 - Current",
      "url": "https://devopsrockstars.com/",
      "accomplishments": [
        "Ran a successful hardware/software consulting practice with broad industry execution in social media, financial services, risk management, agriculture, and healthcare.",
        "Litigated pro se in a federal TTAB trial against a multibillion dollar corporate entity. Received a favorable settlement and garnered hundreds of educational hours studying trademark law."
      ],
      "location": "Chicago, USA",
      "technologies": [
        "React",
        "Ruby on Rails",
        "PostgreSQL"
      ]
    },
    {
      "company": "Real Time Risk Solutions",
      "title": "VP of Engineering",
      "date_range": "Aug 2017 - Jan 2021",
      "url": "https://rtrs.co",
      "accomplishments": [
        "Advanced from a part-time contractor to leading an engineering team building a product used by Fortune 500 companies. Leadership spanned FE/BE, mobile, web and cloud.",
        "Addressed attribute-level merge collisions for a distributed asynchronous write cache.",
        "Coded abstract constructs to enforce a flexible multidimensional REST security model."
      ],
      "location": "Chicago, USA",
      "technologies": [
        "Django",
        "PostgreSQL"
      ]
    },
    {
      "company": "Aker",
      "title": "IoT Engineer (Contract)",
      "date_range": "Aug 2017 - Aug 2019",
      "url": "https://aker.ag",
      "accomplishments": [
        "Wrote a sensor polling subsystem and web-based cluster manager for data aggregation through a hybrid microcontroller SBC fabric. Completed extensive TX/RX serial and I2C programming against INA219, BME280, MCP9808, SSD1306, VL53L0X, DS18B20, and other components.",
        "Developed applicable knowledge of physical prototyping including 3D printing, materials selection, power subsystems, soldering/wiring, and thermal regulation.",
        "Wrote a Nimbleink 4G LTE cellular connection manager and IP route governor for deterministic traffic flow across redundant uplinks." ,
        "Wrote an NMEA stream parser to assemble Exif data comprised of geolocated sensor output.",
        "Implemented a serverless blur detection workflow to identify unprocessable image captures.",
        "Built a web-based wpa_supplicant wrapper to facilitate user-configurable 802.11 parameters.",
        "Wrote a hardware driver for a CDM7160 CO2 module."
      ],
      "location": "Chicago, USA"
    },
    {
      "company": "Ball Horticultural Company",
      "title": "DevOps Engineer (Contract)",
      "date_range": "Sep 2017 - Sep 2020",
      "url": "https://www.ballhort.com/",
      "accomplishments": [
        "Completed extensive application performance profiling to identify bottlenecks and made changes to optimize hardware utilization and response times for deeply-nested/polymorphic data structures.",
        "Automated code signing and release automation of iOS, Android, and Rails applications."
      ],
      "location": "Chicago, USA"
    },
    {
      "company": "The Center for Research Informatics",
      "title": "Senior Systems Administrator",
      "date_range": "Jun 2011 - May 2017",
      "url": "https://cri.uchicago.edu/",
      "accomplishments": [
        "Greenfielded a multimillion dollar computing environment (NIST SP 800-53 compliant).",
        "Implemented an HPC-integrated bioinformatics tool pipelining platform (Galaxy, Torque). Built an API integration to ensure POSIX ACL parity with web libraries.",
        "Developed a customer-facing metered cloud billing system including client invoicing, mainframe transaction processing, roll-up reporting, subsidization tracking, and asset lifecycle initiation (Rails).",
        "Wrote a provisioning tool for synchronizing IAM objects between Internet2 Grouper, Centrify DirectControl, and Isilon OneFS. Achieved global UID/GID to SID coherency."
      ],
      "location": "Chicago, USA"
    },
    {
      "company": "The University of Chicago",
      "title": "Security Engineer",
      "date_range": "Apr 2006 - Jun 2011",
      "url": "https://www.uchicago.edu/",
      "accomplishments": [
        "Identified point in time ownership of L4 NAT sessions by designing a common information model, metadata abstraction schema, and correlation logic for billions of unstructured events (Splunk).",
        "Authored a multi-user GnuPG wrapper to facilitate granular access control to encrypted files.",
        "Performed Expect.pm automation against an IP network comprised of 2000+ programmable assets.",
        "Implemented cross-platform PKI authenticated IPsec. Achieved proficiency in IKE debugging.",
        "Deployed a vendor-neutral network ACL management and provisioning platform."
      ],
      "location": "Chicago, USA"
    }
  ],
  "education": [
    {
      "institution": "The University of Chicago",
      "credential": "Master of Computer Science",
      "url": "https://cs.uchicago.edu/"
    },
    {
      "institution": "The University of Iowa",
      "credential": "Bachelor of Business Administration (Management Information Systems)",
      "url": "https://tippie.uiowa.edu/"
    }
  ]
}
