{
  "first_name": "DAN",
  "last_name": "SULLIVAN",
  "phone_number": {
    "number": "(312) 607-3702",
    "uri": "tel://3126073702"
  },
  "email": {
    "email": "resume@a2f0.net",
    "uri": "mailto:resume@a2f0.net"
  },
  "city_state": "New York, NY",
  "overview": "I am interested in producing quality, maintainable software.",
  "url": "https://github.com/a2f0/resume",
  "internet_presences": [
    "https://a2f0.net",
    "https://tearleads.com",
    "https://devopsrockstars.com",
    "https://github.com/a2f0",
    "https://linkedin.com/in/a2f0"
  ],
  "experience": [
    {
      "company": "Tearleads",
      "title": "Product Builder",
      "date_range": "June 2021 - Current",
      "description": "I optimize repetitive manual access patterns of atomic subproblems to create efficiency for humans in technical roles.",
      "url": "https://tearleads.com/",
      "accomplishments": [
        "Built a publicly available and service to optimize repetitive access patterns of atomic subproblems to create efficiency for humans in technical roles."
      ],
      "location": "Chicago, USA",
      "technologies": [
        "Django",
        "PostgreSQL"
      ]
    },
    {
      "company": "Real Time Risk Solutions",
      "title": "VP of Engineering (Most Recent)",
      "date_range": "January 2021 - April 2021",
      "description": "When I started working at RTRS, I was the sole developer, a contractor, and my hours were capped at seven per week due to funding.  Years later, I led a team of engineers building a product used by Fortune 500 companies. My leadership spanned mobile, web, and backend.",
      "url": "https://rtrs.co",
      "accomplishments": [
        "Adanced from a contractor role to leading a team of engineers building a risk mitigation product being used by Fortune 500 companies.  Leadership spanned FE/BE, mobile, web and cloud.",
        "Wrote over 1000 integration/unit tests for Django/DRF and performed major release framework/dependency upgrades.",
        "Automated deployments and code quality checks using Github Actions."
      ],
      "location": "Chicago, USA",
      "technologies": [
        "Django",
        "PostgreSQL"
      ]
    },
    {
      "company": "Aker",
      "title": "IoT Engineer (Contract)",
      "date_range": "June 2017 - November 2019",
      "description": "This was a cutting edge hardware technology project that I served on as the lead developer for the first two iterations.",
      "url": "https://aker.ag",
      "accomplishments": [
        "Wrote a web-based cluster manager and sensor polling subsystem for parallelized data aggregation across layer 3 boundaries.",
        "Completed extensive TX/RX serial and I2C (AMD SAMD21 Arduino) against ",
        "Wrote custom hardware drivers for a CDM7160 CO2 module and Nimbleink 4G LTE celluar modem. Built a web-based wpa_supplicant wrapper and backend route manager for layer 3 flow between data uplinks."
      ],
      "location": "Chicago, USA"
    },
    {
      "company": "Ball Horticultural Company",
      "title": "DevOps Engineer (Contract)",
      "date_range": "June 2017 - November 2019",
      "description": "Automated the build and release of iOS, Android, and Rails applications, then retained to complete additional work.",
      "url": "https://www.ballhort.com/",
      "accomplishments": [
        "Completed two major version upgrades of a monolithic Rails code base including AMS.",
        "Automated the build and release of iOS, Android, and Rails applications using Jenkins."
      ],
      "location": "Chicago, USA"
    },
    {
      "company": "The Center for Research Informatics",
      "title": "Senior Systems Administrator",
      "date_range": "June 2017 - November 2019",
      "description": "",
      "url": "https://cri.uchicago.edu/",
      "accomplishments": [
        "Greenfielded a multimillion dollar research computing environment. Executed core buildout and consolidated disparate source environments.",
        "Led the design and implementation of an HPC-integrated bioinformatics data analysis and tool pipeline platform (Galaxy, Torque). Automated filesystem hierarchy and POSIX ACL consistency with web data libraries.",
        "Developed a billing ERP system in Ruby on Rails. Coded numerous features including metered cloud billing, client invoicing, mainframe transaction processing, roll-up multidimensional reporting, subsidization tracking, automatic asset lifecycle initiation, and role-based security.",
        "Wrote a Python provisioning tool for synchronizing IAM objects between Internet2 Grouper, Centrify DirectControl, and Isilon OneFS. Achieved global UID/GID to SID coherency."
      ],
      "location": "Chicago, USA"
    },
    {
      "company": "The University of Chicago",
      "title": "Security Engineer",
      "date_range": "June 2017 - November 2019",
      "description": "",
      "url": "https://www.ballhort.com/",
      "accomplishments": [
        "Identified point in time ownership of IP addresses by designing a common information model, metadata abstraction schema, and time series correlation logic for billions of unstructured events (Splunk). Performed index tuning and optimization.",
        "Authored a multi-user GnuPG wrapper for facilitating granular access control to privileged passwords.",
        "Performed Expect.pm automation against an IP network comprised of 2000+ programmable assets.",
        "Implemented cross-platform PKI authenticated IPsec. Achieved proficiency in IKE debugging.",
        "Deployed a vendor-neutral network ACL management and provisioning platform."
      ],
      "location": "Chicago, USA"
    }
  ],
  "education": [
    {
      "institution": "The University of Chicago",
      "credential": "Master of Computer Science",
      "commencement": "Class of 2013",
      "url": "https://cs.uchicago.edu/"
    },
    {
      "institution": "The University of Iowa",
      "credential": "Bachelor of Business Administration (Management Information Systems)",
      "commencement": "Class of 2003",
      "url": "https://tippie.uiowa.edu/"
    }
  ]
}
